In [2]:
import pandas as pd 
import numpy as np

In [3]:
customers = pd.read_csv('customers.csv')
products = pd.read_csv('products.csv')
sales = pd.read_csv('sale.csv')
payments = pd.read_csv('payment.csv')

In [4]:
customers.head()

   customer_id customer_name   age  gender     city signup_date
0            1          Amit  25.0    Male     Pune   08-02-2019
1            2          Riya  28.0  Female   Mumbai   12-06-2020
2            3         Rahul  35.0     NaN    Delhi   02-24-2021
3            4         Sneha  22.0  Female     Pune   09-25-2022
4            5         Arjun  40.0    Male  Chennai   08-05-2019

In [5]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    20 non-null     int64
 1   customer_name  20 non-null     object
 2   age            18 non-null     float64
 3   gender         19 non-null     object
 4   city           19 non-null     object
 5   signup_date    19 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [6]:
#missing null values
customers['age'].isnull().sum()

2

In [7]:
# filling null values in age 
customers['age'] =customers['age'].fillna(customers['age'].mean())

In [8]:
# change the datatypes
customers['age'] = customers['age'].astype(int)

In [9]:
customers.columns

Index(['customer_id', 'customer_name', 'age', 'gender', 'city',
       'signup_date '],
      dtype='object')

In [10]:
# if there is any space in the name of columns
customers.columns = customers.columns.str.replace(' ','')

In [11]:
# change the null values
customers['signup_date'].isnull().sum()

1

In [12]:
# Filling missing value from date 
#most_commin_date = customers['signup_date'].mode()[0]
customers['signup_date'] = customers['signup_date'].fillna(customers['signup_date'].mode()[0])

In [13]:
customers.isnull().sum()

customer_id      0
customer_name    0
age              0
gender           1
city             1
signup_date      0
dtype: int64

In [14]:
customers.dtypes

customer_id       int64
customer_name    object
age               int32
gender           object
city             object
signup_date      object
dtype: object

In [15]:
#change the data type of date object to date
customers['signup_date'] = pd.to_datetime(customers['signup_date'])

In [16]:
customers.dtypes

customer_id               int64
customer_name            object
age                       int32
gender                   object
city                     object
signup_date      datetime64[ns]
dtype: object

In [17]:
customers[['gender','city']].isnull().sum()

gender    1
city      1
dtype: int64

In [18]:
customers['gender'] = customers['gender'].fillna(customers['gender'].mode()[0])

In [19]:
customers['city'] = customers['city'].fillna(customers['city'].mode()[0])

In [20]:
customers[['gender','city']].isnull().sum()

gender    0
city      0
dtype: int64

In [21]:
customers.isnull().sum()

customer_id      0
customer_name    0
age              0
gender           0
city             0
signup_date      0
dtype: int64

In [22]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    20 non-null     int64
 1   customer_name  20 non-null     object
 2   age            20 non-null     int32
 3   gender         20 non-null     object
 4   city           20 non-null     object
 5   signup_date    20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int32(1), int64(1), object(3)
memory usage: 1008.0+ bytes

In [23]:
#customers.to_csv('customer.csv',index = False) -- converted into new file csv

In [24]:
products.head()

   product_id product_name     category  price
0         101       Laptop  Electronics  55000
1         102       Mobile  Electronics  25000
2         103   Headphones  Electronics   3000
3         104     Keyboard  Electronics   1500
4         105        Mouse  Electronics    800

In [25]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    20 non-null     int64
 1   product_name  20 non-null     object
 2   category      20 non-null     object
 3   price         20 non-null     int64
dtypes: int64(2), object(2)
memory usage: 768.0+ bytes

In [26]:
products.isnull().sum()

product_id      0
product_name    0
category        0
price           0
dtype: int64

In [27]:
sales.head()

   sale_id  customer_id  product_id  quantity   sale_date
0        1            1         101         1  02-08-2019
1        2            2         102         2  06-12-2020
2        3            3         103         3  24-02-2021
3        4            4         104         1  25-09-2022
4        5            5         105         4  05-08-2019

In [28]:
# fix the date 
sales['sale_date'] = pd.to_datetime(sales['sale_date'],format ='%d-%m-%Y')

In [29]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sale_id      20 non-null     int64
 1   customer_id  20 non-null     int64
 2   product_id   20 non-null     int64
 3   quantity     20 non-null     int64
 4   sale_date    20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(4)
memory usage: 928.0 bytes

In [30]:
sales.isnull().sum()

sale_id        0
customer_id    0
product_id     0
quantity       0
sale_date      0
dtype: int64

In [31]:
payments.head()

   payment_id  sale_id payment_mode payment_status payment_date
0           1        1  Credit Card        Success   02-08-2019
1           2        2          UPI        Success   06-12-2020
2           3        3   Debit Card         Failed   24-02-2021
3           4        4  Credit Card        Success   25-09-2022
4           5        5         Cash        Success   05-08-2019

In [32]:
payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      20 non-null     int64
 1   sale_id         20 non-null     int64
 2   payment_mode    20 non-null     object
 3   payment_status  20 non-null     object
 4   payment_date    20 non-null     object
dtypes: int64(2), object(3)
memory usage: 928.0+ bytes

In [33]:
payments.isnull().sum()

payment_id        0
sale_id           0
payment_mode      0
payment_status    0
payment_date      0
dtype: int64

In [34]:
payments['payment_date'] = pd.to_datetime(payments['payment_date'],format = '%d-%m-%Y',errors='coerce') #errors='coerce' - hand the anwanted values = nan

In [35]:
payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      20 non-null     int64
 1   sale_id         20 non-null     int64
 2   payment_mode    20 non-null     object
 3   payment_status  20 non-null     object
 4   payment_date    20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 928.0+ bytes

In [36]:
customers['signup_date']

0    2019-08-02
1    2020-12-06
2    2021-02-24
3    2022-09-25
4    2019-08-05
5    2020-08-27
6    2021-08-02
7    2021-01-10
8    2023-12-03
9    2019-07-06
10   2020-03-09
11   2021-01-10
12   2019-10-12
13   2022-07-02
14   2023-08-23
15   2024-08-02
16   2021-09-09
17   2020-05-02
18   2019-10-08
19   2025-08-09
Name: signup_date, dtype: datetime64[ns]

In [37]:
# for date you will get the year 
payments['payment_date'] = payments['payment_date'].dt.year

In [38]:
#payment['payment_years'] = payment['payment_date'].dt.year  diff columns of year

In [39]:
payments

    payment_id  sale_id payment_mode payment_status  payment_date
0            1        1  Credit Card        Success          2019
1            2        2          UPI        Success          2020
2            3        3   Debit Card         Failed          2021
3            4        4  Credit Card        Success          2022
4            5        5         Cash        Success          2019
5            6        6  Net Banking        Success          2020
6            7        7  Credit Card         Failed          2021
7            8        8          UPI        Success          2021
8            9        9   Debit Card        Success          2023
9           10       10  Credit Card        Success          2019
10          11       11         Cash        Success          2020
11          12       12          UPI         Failed          2021
12          13       13  Credit Card        Success          2019
13          14       14  Net Banking        Success          2022
14          15       15   Debit Card        Success          2023
15          16       16          UPI        Success          2024
16          17       17  Credit Card        Success          2021
17          18       18  Net Banking         Failed          2020
18          19       19         Cash        Success          2019
19          20       20  Credit Card        Success          2025

In [40]:
customers.head()

   customer_id customer_name  age  gender     city signup_date
0            1          Amit   25    Male     Pune  2019-08-02
1            2          Riya   28  Female   Mumbai  2020-12-06
2            3         Rahul   35  Female    Delhi  2021-02-24
3            4         Sneha   22  Female     Pune  2022-09-25
4            5         Arjun   40    Male  Chennai  2019-08-05

In [41]:
products.head()

   product_id product_name     category  price
0         101       Laptop  Electronics  55000
1         102       Mobile  Electronics  25000
2         103   Headphones  Electronics   3000
3         104     Keyboard  Electronics   1500
4         105        Mouse  Electronics    800

In [42]:
sales.head()

   sale_id  customer_id  product_id  quantity  sale_date
0        1            1         101         1 2019-08-02
1        2            2         102         2 2020-12-06
2        3            3         103         3 2021-02-24
3        4            4         104         1 2022-09-25
4        5            5         105         4 2019-08-05

In [43]:
payments.head()

   payment_id  sale_id payment_mode payment_status  payment_date
0           1        1  Credit Card        Success          2019
1           2        2          UPI        Success          2020
2           3        3   Debit Card         Failed          2021
3           4        4  Credit Card        Success          2022
4           5        5         Cash        Success          2019

In [44]:
payments['payment_status']

0     Success
1     Success
2      Failed
3     Success
4     Success
5     Success
6      Failed
7     Success
8     Success
9     Success
10    Success
11     Failed
12    Success
13    Success
14    Success
15    Success
16    Success
17     Failed
18    Success
19    Success
Name: payment_status, dtype: object

In [45]:
#if there is any missing values in pending columns
payments['payment_status'].fillna('pending',inplace = True)

In [46]:
payments

    payment_id  sale_id payment_mode payment_status  payment_date
0            1        1  Credit Card        Success          2019
1            2        2          UPI        Success          2020
2            3        3   Debit Card         Failed          2021
3            4        4  Credit Card        Success          2022
4            5        5         Cash        Success          2019
5            6        6  Net Banking        Success          2020
6            7        7  Credit Card         Failed          2021
7            8        8          UPI        Success          2021
8            9        9   Debit Card        Success          2023
9           10       10  Credit Card        Success          2019
10          11       11         Cash        Success          2020
11          12       12          UPI         Failed          2021
12          13       13  Credit Card        Success          2019
13          14       14  Net Banking        Success          2022
14          15       15   Debit Card        Success          2023
15          16       16          UPI        Success          2024
16          17       17  Credit Card        Success          2021
17          18       18  Net Banking         Failed          2020
18          19       19         Cash        Success          2019
19          20       20  Credit Card        Success          2025

In [47]:
sales['sale_year'] = sales['sale_date'].dt.year
customers['signup_year'] = customers['signup_date'].dt.year

In [48]:
sales

    sale_id  customer_id  product_id  quantity  sale_date  sale_year
0         1            1         101         1 2019-08-02       2019
1         2            2         102         2 2020-12-06       2020
2         3            3         103         3 2021-02-24       2021
3         4            4         104         1 2022-09-25       2022
4         5            5         105         4 2019-08-05       2019
5         6            6         106         1 2020-08-27       2020
6         7            7         107         2 2021-08-02       2021
7         8            8         108         5 2021-01-10       2021
8         9            9         109         1 2023-12-03       2023
9        10           10         110         1 2019-07-06       2019
10       11           11         111        10 2020-03-09       2020
11       12           12         112         2 2021-01-10       2021
12       13           13         113         3 2019-10-12       2019
13       14           14         114         1 2022-07-02       2022
14       15           15         115         2 2023-08-23       2023
15       16           16         116         4 2024-08-02       2024
16       17           17         117         1 2021-09-09       2021
17       18           18         118         1 2020-05-02       2020
18       19           19         119         6 2019-10-08       2019
19       20           20         120         2 2025-08-09       2025

In [49]:
customers

    customer_id customer_name  age  gender       city signup_date  signup_year
0             1          Amit   25    Male       Pune  2019-08-02         2019
1             2          Riya   28  Female     Mumbai  2020-12-06         2020
2             3         Rahul   35  Female      Delhi  2021-02-24         2021
3             4         Sneha   22  Female       Pune  2022-09-25         2022
4             5         Arjun   40    Male    Chennai  2019-08-05         2019
5             6          Neha   30  Female       Pune  2020-08-27         2020
6             7         Karan   27    Male       Pune  2021-08-02         2021
7             8         Pooja   33  Female     Mumbai  2021-01-10         2021
8             9         Ankit   29    Male     Jaipur  2023-12-03         2023
9            10         Meena   45  Female      Delhi  2019-07-06         2019
10           11         Rohit   38    Male  Bangalore  2020-03-09         2020
11           12         Kavya   26  Female    Chennai  2021-01-10         2021
12           13        Suresh   32    Male  Hyderabad  2019-10-12         2019
13           14         Nisha   31  Female       Pune  2022-07-02         2022
14           15        Vikram   36    Male     Mumbai  2023-08-23         2023
15           16          Tina   24  Female  Ahmedabad  2024-08-02         2024
16           17         Mohan   32    Male      Surat  2021-09-09         2021
17           18          Isha   34  Female     Indore  2020-05-02         2020
18           19       Prakash   47    Male     Bhopal  2019-10-08         2019
19           20         Divya   29  Female     Nagpur  2025-08-09         2025

In [50]:
payments['payment_date']

0     2019
1     2020
2     2021
3     2022
4     2019
5     2020
6     2021
7     2021
8     2023
9     2019
10    2020
11    2021
12    2019
13    2022
14    2023
15    2024
16    2021
17    2020
18    2019
19    2025
Name: payment_date, dtype: int32

In [51]:
payments

    payment_id  sale_id payment_mode payment_status  payment_date
0            1        1  Credit Card        Success          2019
1            2        2          UPI        Success          2020
2            3        3   Debit Card         Failed          2021
3            4        4  Credit Card        Success          2022
4            5        5         Cash        Success          2019
5            6        6  Net Banking        Success          2020
6            7        7  Credit Card         Failed          2021
7            8        8          UPI        Success          2021
8            9        9   Debit Card        Success          2023
9           10       10  Credit Card        Success          2019
10          11       11         Cash        Success          2020
11          12       12          UPI         Failed          2021
12          13       13  Credit Card        Success          2019
13          14       14  Net Banking        Success          2022
14          15       15   Debit Card        Success          2023
15          16       16          UPI        Success          2024
16          17       17  Credit Card        Success          2021
17          18       18  Net Banking         Failed          2020
18          19       19         Cash        Success          2019
19          20       20  Credit Card        Success          2025

In [52]:
payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      20 non-null     int64
 1   sale_id         20 non-null     int64
 2   payment_mode    20 non-null     object
 3   payment_status  20 non-null     object
 4   payment_date    20 non-null     int32
dtypes: int32(1), int64(2), object(2)
memory usage: 848.0+ bytes

In [53]:
#pip install sqlalchemy mysql-connector-python

In [54]:
payments

    payment_id  sale_id payment_mode payment_status  payment_date
0            1        1  Credit Card        Success          2019
1            2        2          UPI        Success          2020
2            3        3   Debit Card         Failed          2021
3            4        4  Credit Card        Success          2022
4            5        5         Cash        Success          2019
5            6        6  Net Banking        Success          2020
6            7        7  Credit Card         Failed          2021
7            8        8          UPI        Success          2021
8            9        9   Debit Card        Success          2023
9           10       10  Credit Card        Success          2019
10          11       11         Cash        Success          2020
11          12       12          UPI         Failed          2021
12          13       13  Credit Card        Success          2019
13          14       14  Net Banking        Success          2022
14          15       15   Debit Card        Success          2023
15          16       16          UPI        Success          2024
16          17       17  Credit Card        Success          2021
17          18       18  Net Banking         Failed          2020
18          19       19         Cash        Success          2019
19          20       20  Credit Card        Success          2025

In [5]:
customers

    customer_id customer_name   age  gender       city signup_date
0             1          Amit  25.0    Male       Pune   08-02-2019
1             2          Riya  28.0  Female     Mumbai   12-06-2020
2             3         Rahul  35.0     NaN      Delhi   02-24-2021
3             4         Sneha  22.0  Female       Pune   09-25-2022
4             5         Arjun  40.0    Male    Chennai   08-05-2019
5             6          Neha  30.0  Female        NaN   08-27-2020
6             7         Karan  27.0    Male       Pune   08-02-2021
7             8         Pooja  33.0  Female     Mumbai          NaN
8             9         Ankit  29.0    Male     Jaipur   12-03-2023
9            10         Meena  45.0  Female      Delhi   07-06-2019
10           11         Rohit  38.0    Male  Bangalore   03-09-2020
11           12         Kavya  26.0  Female    Chennai   01-10-2021
12           13        Suresh   NaN    Male  Hyderabad   10-12-2019
13           14         Nisha  31.0  Female       Pune   07-02-2022
14           15        Vikram  36.0    Male     Mumbai   08-23-2023
15           16          Tina  24.0  Female  Ahmedabad   08-02-2024
16           17         Mohan   NaN    Male      Surat   09-09-2021
17           18          Isha  34.0  Female     Indore   05-02-2020
18           19       Prakash  47.0    Male     Bhopal   10-08-2019
19           20         Divya  29.0  Female     Nagpur   08-09-2025